# -*- coding: utf-8 -*-
from math import atan, degrees, tan

class Dim:
    "Клас описує поняття розміру"
    n=0.0 #номінальний розмір
    ei=0.0 #нижнє відхилення
    es=0.0 #верхнє відхилення
    v=0.0 #дійсне значення
    def __init__(self,n,ei,es,doc):
        "конструктор"
        self.n=n
        self.ei=ei
        self.es=es
        self.__doc__=doc.decode('utf-8')
    def min(self):
        "повертає мінімальний розмір"
        return self.n+self.ei
    def max(self):
        "повертає максимальний розмір"
        return self.n+self.es
    

zn80={'D':Dim(80,-0.5,0.5,"зовнішній діаметр труби ніпеля"),
    'D1':Dim(76.5,-0.5,0.5,"зовнішній діаметр упорного торця"),
    'd3':Dim(25.0,-0.6,0.6,"внутрішній діаметр ніпеля"),
    'd4':Dim(36.0,-0.6,0.6,"внутрішній діаметр муфти"),
    'L2':Dim(240.0,0.0,0.0,"довжина муфти*"),
    'dsr':Dim(60.080,0.0,0.0,"середній діаметр різьби в основній площині"),
    'd5':Dim(66.674,0.0,0.0,"діаметр більшої основи конуса ніпеля*"),
    'd6':Dim(47.674,0.0,0.0,"діаметр меншої основи конуса ніпеля*"),
    'l3':Dim(76.0,-2.0,0,"довжина конуса ніпеля"),
    'd7':Dim(68.3,-0.6,0.6,"діаметр конічної виточки в площині торця муфти"),
    'd8':Dim(61.422,0.0,0.0,"внутрішній діаметр різьби в площині торця муфти*"),
    'l4':Dim(82.0,0.0,0.0,"відстань від торця до кінця різьби з повним профілем муфти (не менше)"),
    'P':Dim(5.080,0.0,0.0,"крок різьби паралельно осі різьби"),
    'fi':Dim(atan(0.25/2),0.0,0.0,"кут нахилу (рад.)"),
    'H':Dim(4.376,0.0,0.0,"висота гострокутного профілю"),
    'h1':Dim(2.993,0.0,0.0,"висота профілю різьби"),
    'h':Dim(2.626,0.0,0.0,"робоча висота профілю"),
    'l':Dim(0.875,0.0,0.0,"висота зрізу вершин"),
    'f':Dim(0.508,0.0,0.0,"відтин впадини"),
    'a':Dim(1.016,0.0,0.0,"площадка*"),
    'r':Dim(0.508,0.0,0.0,"радіус заокруглень впадин*"),
    'r_':Dim(0.38,0.0,0.0,"радіус спряжень (не більше)"),
    'lsr':Dim(15.875,0.0,0.0,"відстань від торця муфти/ніпеля до основної площини")}

class ZN: pass
d=ZN()
for key,value in zn80.iteritems():
    setattr(d,key,value.n)

# допоміжні параметри:
h=tan(d.fi)*(d.l4-d.lsr)
d._r=d.dsr/2-h # радіус середнього діаметра в площині l4 (менший радіус конуса муфти)
x1,y1 = -d.H/2, 0 # вектор переміщення в 0,0 сер діам різця ніпеля
x2,y2 = -d.H/2+tan(d.fi)*d.P/2, d.P/2 # -//- муфти
d._v1 = x1+d._r, y1+d.l3-d.l4, 0  # поч положення різця ніпеля
d._v2 = x2+d._r, y2+d.l3-d.l4, 0 # поч положення різця муфти


if __name__=='__main__':
    print d.d3
    #print d.d3.__doc__
